// кроме массивов есть разные списки и хранилища для множественных значений
//List - одномерный список, который заменяет работу с массивом
// про List немного уже разговаривали

// словарь с ключем
// хранение значений ассоциированных с ключем
//Dictionary<ТипКлюча, ТипЗначения> dictionary =
//  new Dictionary<ТипКлюча, ТипЗначения>();

/*
Dictionary<string, string> sample1 = new();
// string - тип ключа. Ключи не могут повторяться для разных значений
// string - тип значения, значения могут повторяться, но ключи должны быть разные
// вместо индексов в словаре используется ключ-значение
sample1.Add("Понедельник", "4 пары");
sample1.Add("Вторник", "3 пары");
sample1.Add("Среда", "3 пары");
sample1.Add("Четверг", "2 пары");
sample1.Add("Пятница", "5 пар");
sample1.Add("Суббота", "2 пары");
sample1.Add("Воскресенье", "нет пар");

var value = sample1["Среда"]; // получение значения по ключу

if (sample1.ContainsKey("Воскресенье"))
    sample1["Воскресенье"] = "Хороший день";

// можно получить уникальный ключ с помощью структуры Guid
for (int i = 1; i < 10; i++)
{
    string key = Guid.NewGuid().ToString();
    Console.WriteLine(key);
}

sample1.Remove("Суббота"); // удаление значения по ключу (ключ тоже удалится)

// словарь удобно использовать в случае, если в памяти
// есть большой список объектов и нам часто надо искать
// эти объекты для чтения или изменения

// можно получить массив ключей
var allKeys = sample1.Keys.ToArray();
foreach (var key in allKeys)
    Console.WriteLine(key);

// можно получить массив значений
var allValues = sample1.Values.ToArray();
foreach (var val in allValues)
    Console.WriteLine(val);

*/

// стопка Stack очередь Queue
//LIFO - last input first output - последним пришел - первым вышел (стопка, стек)
//FIFO - first input first output - первым пришел - первым вышел (очередь)

// Stack - можно представить как стопку бумаги - мы накладываем листы
// но берем лист сверху (т.е. последний лист идет в обработку первым)

// пример создания стека
/*
Stack<int> stack = new Stack<int>();
// помещение значения в стек идет через метод push
stack.Push(10);
stack.Push(100);
stack.Push(10);
stack.Push(1000);
Console.WriteLine($"Кол-во элементов в стеке:" + stack.Count);
// получение значения - pop и peek
int value = stack.Peek(); // прочитать значение, но оставить его в стеке
Console.WriteLine("Просто посмотреть:" + value);
value = stack.Pop(); // прочитать значение и удалить его из стека
Console.WriteLine(value);
value = stack.Pop(); // прочитать значение и удалить его из стека
Console.WriteLine(value);
value = stack.Pop(); // прочитать значение и удалить его из стека
Console.WriteLine(value);
Console.WriteLine($"Кол-во элементов в стеке:" + stack.Count);
// если вызвать Pop на стеке с Count == 0, то будет исключение
// стек удобно использовать для хранения истории действий и чего-то подобного
// стек может заменить рекурсивный метод
*/
/*
int value = sum(1);
Console.WriteLine(value);

// эту рекурсию можно переделать на использование стека
//int sum(int a)
//{
//    if (a < 10)
//        return a + sum(++a);
//    return a;
//}

// замена рекурсии на использование стека

int sum(int value)
{
    Stack<int> stack = new Stack<int>();
    stack.Push(value); // начальный метод
    int a, result = 0;
    while (stack.Count > 0) // повторение, пока в стеке есть аргументы
    {
        a = stack.Pop(); // основное отличие от рекурсии - мы убираем из стека обработанные значения
        result += a; // действие рекурсивного метода - суммирование значений
        if (a < 10) // помещение значения в стек по такому же условию, как в рекурсивном методе
            stack.Push(++a);
    } 
    return result;
}*/

// очередь
Queue<int> queue = new Queue<int>();
queue.Enqueue(1); // добавление элемента
int value = queue.Dequeue(); // получить элемент из очереди и удалить
int count = queue.Count; // кол-во элементов в очереди
value = queue.Peek(); // прочитать элемент без удаления

//Queue используется для последовательной обработки команд, когда важна очередность
