// рекурсия
// рекурсивные вызовы - вызов метода
// внутри того же метода

// первый вызов метода
/*
Sample(0);

Console.WriteLine(Sum(0));
// метод
void Sample(int i)
{
    Console.WriteLine("hi " + i);
    // рекурсивный вызов метода
    if (i < 10)
        Sample(i + 1);
}

// рекурсивный метод будет вызывать рекурсию
// до тех пор, пока не будет прерван один из вызовов

// при работе с рекурсией важно понимать, что каждый вызов
// метода создает запись в стеке, каждый раз, когда вызывается
// новый вызов метода, текущий метод останавливается и ждет
// пока не завершится вызванный метод, а тот в свою очередь
// ждет пока завершится следующий дочерний вызов
// все эти вызовы заполняют стек, который ограничен (примерно 1Мб)
// в стек записываются ссылки на новый метод, на каждый аргумент (ссылки или значения)
// если рекурсия не завершается, либо происходит большое 
// кол-во раз - происходит переполнение стека, приложение 
// аварийно завершается, не сохраняя состояние работы и тп

// в рекурсии должно быть условие завершения - т.е. метод
// в какой-то момент не должен вызвать себя в очередной раз
// тогда вся рекурсия схлопнется - каждый вызванный метод завершится
// при этом каждый вызванный метод может вернуть значение
// в родительский метод - можно посчитать результаты выполнения всех рекурсивных вызовов

int Sum(int a)
{
    if (a >= 10)
        return a;
    return a + Sum(a + 1);
}

// любой рекурсивный метод можно заменить циклом с использованием
// стека (Stack) - специальная коллекция, куда можно передавать значения
// и получать потом их оттуда
*/